import { memo } from 'react';

import { ChartCard } from '@/entities/ChartCard';

import cls from './ChartList.module.scss';

const charts = [{
    title: 'Динамика ценностей',
    labels: [
        'Оценка лояльности сотрудников (метод eNPS)',
        'Показатель врнутреннего карьерного роста',
        'Индекс счастья',
        'Уровень удовлетворенности работой',
        'Коэффициент абсентеизма',
        'Коэффициент развития сотрудников',
        'Индекс удовлетворенности'
    ],
    datasets: [{
        label: '24.05.2021',
        data: [0.8, 0.85, 0.95, 0.85, 0.95, 0.7, 1],
        fill: false,
        borderColor: '#ED7D31',
    }, {
        label: '25.08.2021',
        data: [0.65, 0.85, 0.95, 0.85, 0.95, 1, 0.9],
        fill: false,
        borderColor: '#4472C4',
    }, {
        label: '26.12.2021',
        data: [0.85, 0.85, 0.9, 0.95, 0.7, 0.6, 1],
        fill: false,
        borderColor: '#A5A5A5'
    }]
}, {
    title: 'Динамика метрик',
    labels: [
        'Оценка лояльности сотрудников (метод eNPS)',
        'Показатель врнутреннего карьерного роста',
        'Индекс счастья',
        'Уровень удовлетворенности работой',
        'Коэффициент абсентеизма',
        'Коэффициент развития сотрудников',
        'Индекс удовлетворенности'
    ],
    datasets: [{
        label: '24.05.2021',
        data: [0.8, 0.85, 0.95, 0.85, 0.95, 0.7, 1],
        fill: false,
        borderColor: '#ED7D31',
    }, {
        label: '25.08.2021',
        data: [0.65, 0.85, 0.95, 0.85, 0.95, 1, 0.9],
        fill: false,
        borderColor: '#4472C4',
    }, {
        label: '26.12.2021',
        data: [0.85, 0.85, 0.9, 0.95, 0.7, 0.6, 1],
        fill: false,
        borderColor: '#A5A5A5'
    }]
}, {
    title: 'Риски',
    labels: [
        'Оценка лояльности сотрудников (метод eNPS)',
        'Показатель врнутреннего карьерного роста',
        'Индекс счастья',
        'Уровень удовлетворенности работой',
        'Коэффициент абсентеизма',
        'Коэффициент развития сотрудников',
        'Индекс удовлетворенности'
    ],
    datasets: [{
        label: '24.05.2021',
        data: [0.8, 0.85, 0.95, 0.85, 0.95, 0.7, 1],
        fill: false,
        borderColor: '#ED7D31',
    }, {
        label: '25.08.2021',
        data: [0.65, 0.85, 0.95, 0.85, 0.95, 1, 0.9],
        fill: false,
        borderColor: '#4472C4',
    }, {
        label: '26.12.2021',
        data: [0.85, 0.85, 0.9, 0.95, 0.7, 0.6, 1],
        fill: false,
        borderColor: '#A5A5A5'
    }]
}, {
    title: 'Сотрудники',
    labels: [
        'Оценка лояльности сотрудников (метод eNPS)',
        'Показатель врнутреннего карьерного роста',
        'Индекс счастья',
        'Уровень удовлетворенности работой',
        'Коэффициент абсентеизма',
        'Коэффициент развития сотрудников',
        'Индекс удовлетворенности'
    ],
    datasets: [{
        label: '24.05.2021',
        data: [0.8, 0.85, 0.95, 0.85, 0.95, 0.7, 1],
        fill: false,
        borderColor: '#ED7D31',
    }, {
        label: '25.08.2021',
        data: [0.65, 0.85, 0.95, 0.85, 0.95, 1, 0.9],
        fill: false,
        borderColor: '#4472C4',
    }, {
        label: '26.12.2021',
        data: [0.85, 0.85, 0.9, 0.95, 0.7, 0.6, 1],
        fill: false,
        borderColor: '#A5A5A5'
    }]
}]



export const ChartList = memo(() => (
    <section className={cls.ChartList}>
        <ul>
            {charts.map((item, index) => (
                <li key={index}>
                    <ChartCard title={item.title} labels={item.labels} datasets={item.datasets} />
                </li>
            ))}
        </ul>
    </section>
));
